## Plan Result (prod_app_registrations - TerraformPlanApply)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d&#34;]
* Update
  * module.this.azuread_application.this[&#34;darts-portal-v2&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["darts-portal-v2"] will be updated in-place
  ~ resource "azuread_application" "this" {
        id                             = "78e19e28-a66e-4ae0-9db6-9b861d749233"
      ~ owners                         = [
          - "675f1c23-3e46-4cf8-867b-747eb60fe89d",
            # (1 unchanged element hidden)
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["darts-portal-v2"] has changed
  ~ resource "azuread_application" "this" {
        id                             = "78e19e28-a66e-4ae0-9db6-9b861d749233"
      ~ owners                         = [
          + "675f1c23-3e46-4cf8-867b-747eb60fe89d",
            # (1 unchanged element hidden)
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



## :warning: Errors

* add a label prod_app_registrations - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-github-federation-config/issues/66/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":66,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations - TerraformPlanApply","Vars":{}} -->